/* automatically generated by rust-bindgen 0.69.4 */

pub const CONFIG_y: u32 = 1;
pub const CONFIG_m: u32 = 2;
pub const CONFIG_HOST_LINUX: u32 = 1;
pub const CONFIG_APPS_DIR: &[u8; 8] = b"../apps\0";
pub const CONFIG_BASE_DEFCONFIG: &[u8; 20] = b"nucleo-144:f746-nsh\0";
pub const CONFIG_BUILD_FLAT: u32 = 1;
pub const CONFIG_RAW_BINARY: u32 = 1;
pub const CONFIG_ARCH_HAVE_STDARG_H: u32 = 1;
pub const CONFIG_ARCH_HAVE_SETJMP: u32 = 1;
pub const CONFIG_ARCH_NONE_DEBUG_H: u32 = 1;
pub const CONFIG_FORTIFY_SOURCE: u32 = 0;
pub const CONFIG_NDEBUG: u32 = 1;
pub const CONFIG_DEBUG_ALERT: u32 = 1;
pub const CONFIG_ARCH_HAVE_STACKCHECK: u32 = 1;
pub const CONFIG_STACK_COLORATION: u32 = 1;
pub const CONFIG_STACK_USAGE_WARNING: u32 = 0;
pub const CONFIG_ARCH_HAVE_HEAPCHECK: u32 = 1;
pub const CONFIG_DEBUG_SYMBOLS: u32 = 1;
pub const CONFIG_ARCH_HAVE_CUSTOMOPT: u32 = 1;
pub const CONFIG_DEBUG_NOOPT: u32 = 1;
pub const CONFIG_DEBUG_OPT_UNUSED_SECTIONS: u32 = 1;
pub const CONFIG_DEBUG_LINK_MAP: u32 = 1;
pub const CONFIG_ARCH_ARM: u32 = 1;
pub const CONFIG_ARCH: &[u8; 4] = b"arm\0";
pub const CONFIG_ARM_TOOLCHAIN_GNU_EABI: u32 = 1;
pub const CONFIG_ARCH_CHIP_STM32F7: u32 = 1;
pub const CONFIG_ARCH_ARMV7M: u32 = 1;
pub const CONFIG_ARCH_CORTEXM7: u32 = 1;
pub const CONFIG_ARCH_FAMILY: &[u8; 8] = b"armv7-m\0";
pub const CONFIG_ARCH_CHIP: &[u8; 8] = b"stm32f7\0";
pub const CONFIG_ARM_THUMB: u32 = 1;
pub const CONFIG_ARM_HAVE_MPU_UNIFIED: u32 = 1;

pub type int_least64_t = _int64_t;
pub type uint_least64_t = _uint64_t;
pub type int_fast8_t = _int8_t;
pub type uint_fast8_t = _uint8_t;
pub type int_fast16_t = ::std::os::raw::c_int;
pub type uint_fast16_t = ::std::os::raw::c_uint;
pub type int_fast24_t = _int32_t;
pub type uint_fast24_t = _uint32_t;
pub type int_fast32_t = _int32_t;
pub type uint_fast32_t = _uint32_t;
pub type int_fast64_t = _int64_t;
pub type uint_fast64_t = _uint64_t;
pub type intmax_t = _intmax_t;
pub type uintmax_t = _uintmax_t;
extern "C" {
    #[doc = " Name: stm32_bringup\n\n Description:\n   Perform architecture specific initialization\n\n   CONFIG_BOARDCTL=y:\n     If CONFIG_NSH_ARCHINITIALIZE=y:\n       Called from the NSH library (or other application)\n     Otherwise, assumed to be called from some other application.\n\n   Otherwise CONFIG_BOARD_LATE_INITIALIZE=y:\n     Called from board_late_initialize().\n\n   Otherwise, bad news:  Never called\n"]
    pub fn stm32_bringup() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn stm32_spidev_initialize();
}
extern "C" {
    #[doc = " Name: stm32_dma_alloc_init\n\n Description:\n   Called to create a FAT DMA allocator\n\n Returned Value:\n   0 on success or -ENOMEM\n"]
    pub fn stm32_dma_alloc_init();
}
pub type mode_t = ::std::os::raw::c_uint;
pub type rsize_t = _size_t;
pub type uid_t = ::std::os::raw::c_uint;
pub type gid_t = ::std::os::raw::c_uint;
pub type dev_t = u32;
pub type ino_t = u16;
pub type nlink_t = u16;
pub type pid_t = ::std::os::raw::c_int;
pub type id_t = ::std::os::raw::c_int;
pub type key_t = i32;
pub type wchar_t = _wchar_t;
pub type wint_t = ::std::os::raw::c_int;
pub type wctype_t = ::std::os::raw::c_int;
pub type fsblkcnt_t = u32;
pub type fsfilcnt_t = u32;
pub type blkcnt_t = u32;
pub type off_t = i32;
pub type fpos_t = i32;
pub type blksize_t = i16;
pub type socklen_t = ::std::os::raw::c_uint;
pub type sa_family_t = u16;
pub type clock_t = u32;
pub type time_t = u32;
pub type clockid_t = ::std::os::raw::c_int;
pub type timer_t = *mut ::std::os::raw::c_void;
pub type useconds_t = u32;
pub type suseconds_t = i32;
pub type cpu_set_t = u8;
pub type u_char = ::std::os::raw::c_uchar;
pub type u_short = ::std::os::raw::c_ushort;
pub type u_int = ::std::os::raw::c_uint;
pub type u_long = ::std::os::raw::c_ulong;
pub type unchar = ::std::os::raw::c_uchar;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type ulong = ::std::os::raw::c_ulong;
pub type s_char = ::std::os::raw::c_schar;
pub type caddr_t = *mut ::std::os::raw::c_char;
pub type u_int8_t = u8;
pub type u_int16_t = u16;
pub type u_int32_t = u32;
pub type u_int64_t = u64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fsid_s {
    pub val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout_fsid_s() {
    const UNINIT: ::std::mem::MaybeUninit<fsid_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fsid_s>(),
        8usize,
        concat!("Size of: ", stringify!(fsid_s))
    );
    assert_eq!(
        ::std::mem::align_of::<fsid_s>(),
        4usize,
        concat!("Alignment of ", stringify!(fsid_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fsid_s),
            "::",
            stringify!(val)
        )
    );
}
pub type main_t = ::std::option::Option<
    unsafe extern "C" fn(
        argc: ::std::os::raw::c_int,
        argv: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int,
>;
pub const ERROR: _bindgen_ty_1 = -1;
pub const OK: _bindgen_ty_1 = 0;
pub type _bindgen_ty_1 = ::std::os::raw::c_int;
extern "C" {
    pub fn nsh_main(
        argc: ::std::os::raw::c_int,
        argv: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xcptcontext {
    pub sigdeliver: *mut ::std::os::raw::c_void,
    pub saved_regs: *mut u32,
    pub regs: *mut u32,
}
#[test]
fn bindgen_test_layout_xcptcontext() {
    const UNINIT: ::std::mem::MaybeUninit<xcptcontext> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<xcptcontext>(),
        24usize,
        concat!("Size of: ", stringify!(xcptcontext))
    );
    assert_eq!(
        ::std::mem::align_of::<xcptcontext>(),
        8usize,
        concat!("Alignment of ", stringify!(xcptcontext))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sigdeliver) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xcptcontext),
            "::",
            stringify!(sigdeliver)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).saved_regs) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(xcptcontext),
            "::",
            stringify!(saved_regs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).regs) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(xcptcontext),
            "::",
            stringify!(regs)
        )
    );
}
extern "C" {
    #[doc = " Public Data"]
    pub static mut g_current_regs: [*mut u32; 1usize];
}
pub type irq_t = u8;
pub type xcpt_t = ::std::option::Option<
    unsafe extern "C" fn(
        irq: ::std::os::raw::c_int,
        context: *mut ::std::os::raw::c_void,
        arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    #[doc = " Name: irq_attach\n\n Description:\n   Configure the IRQ subsystem so that IRQ number 'irq' is dispatched to\n   'isr' with argument 'arg'\n"]
    pub fn irq_attach(
        irq: ::std::os::raw::c_int,
        isr: xcpt_t,
        arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub static g_gpiobase: [u32; 11usize];
}
extern "C" {
